{
  "pageTitle": "Schlüsselpaare bei Nostr",
  "pageSubtitle": "Eine Einführung in die Konzepte privater und öffentlicher Schlüssel und deren zentrale Rolle im Nostr-Netzwerk",
  "sections": {
    "intro": {
      "title": "Erklärung der Schlüsselpaare",
      "content": "Im Nostr-Netzwerk dienen öffentliche Schlüssel als Identitäten der Benutzer, während private Schlüssel zur Signierung von Nachrichten verwendet werden. Empfänger können die Signatur mit dem öffentlichen Schlüssel verifizieren, um die Authentizität der Nachricht sicherzustellen.",
      "content-info": "Schlüsselpaare bestehen aus zwei Teilen:"
    },
    "privateKey": {
      "title": "Privater Schlüssel (nsec)",
      "content": "Ein geheimer 256-Bit-Wert, der sicher und geheim gehalten wird. Er wird verwendet, um Nachrichten zu signieren und die Identität des Benutzers zu bestätigen."
    },
    "publicKey": {
      "title": "Öffentlicher Schlüssel (npub)",
      "content": "Ein öffentlicher Code, der frei verteilt werden kann. Er wird genutzt, um Nachrichten zu verschlüsseln und Signaturen zu verifizieren, die mit dem privaten Schlüssel erstellt wurden."
    },
    "security": {
      "title": "Sicherheitshinweise",
      "content": "Bewahren Sie Ihren privaten Schlüssel an einem sicheren Ort auf. Nutzen Sie sichere Speicherlösungen wie Hardware-Wallets oder verschlüsselte digitale Speicher.",
      "warning": "Warnung: Wenn Sie Ihren privaten Schlüssel verlieren, verlieren Sie für immer den Zugang zu Ihrem Konto. Es gibt keine Möglichkeit, ihn wiederherzustellen!",
      "guidelines": {
        "title": "Wichtige Sicherheitsrichtlinien",
        "storage": "Sichere Aufbewahrung: Bewahren Sie Ihren privaten Schlüssel an einem sicheren Ort auf.",
        "backup": "Backup: Erstellen Sie ein Backup Ihres privaten Schlüssels.",
        "trust": "Vertrauen: Teilen Sie Ihren privaten Schlüssel niemals mit anderen Personen."
      }
    },
    "technical": {
      "title": "Technische Details",
      "subtitle": "Erzeugung von Schlüsselpaaren bei Nostr",
      "privateKeyGen": {
        "title": "1. Privater Schlüssel",
        "content": "Ein zufälliger 256-Bit-Wert wird generiert, der den privaten Schlüssel darstellt und geheim gehalten wird.",
        "code": "privateKey = random(256 bits)"
      },
      "publicKeyGen": {
        "title": "2. Öffentlicher Schlüssel",
        "content": "Durch Multiplikation des privaten Schlüssels mit der elliptischen Kurve secp256k1 wird der entsprechende öffentliche Schlüssel erzeugt.",
        "code": "publicKey = secp256k1 * privateKey"
      },
      "conclusion": "Diese Schlüsselpaare ermöglichen es den Benutzern, sicher und authentisch im Nostr-Netzwerk zu kommunizieren."
    },
    "generator": {
      "title": "Schlüssel generieren",
      "button": "Neue Schlüssel generieren",
      "privateKeyLabel": "Ihr privater Schlüssel (nsec):",
      "publicKeyLabel": "Ihr öffentlicher Schlüssel (npub):",
      "copyButton": "Kopieren",
      "copied": "Kopiert!",
      "downloadButton": "Schlüssel herunterladen"
    }
  },
  "errors": {
    "generateFailed": "Schlüsselgenerierung fehlgeschlagen",
    "copyFailed": "Kopieren fehlgeschlagen"
  }
}
